seok930927/ESP32-iperf-W5500/managed_components/espressif__iperf/iperf.c
/*
 * SPDX-FileCopyrightText: 2024 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#include <stdio.h>
#include <string.h>
#include <sys/param.h>
// #include <sys/socket.h>
#include "sdkconfig.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
/* esp_check.h was added in idf v4.4 */
#include "iperf_esp_check.h"
#include "esp_log.h"
#include "iperf.h"
#include "esp_attr.h"

#include "esp_idf_version.h"

#include "W5500/w5500.h"
#include "wizchip_conf.h"
#include "socket.h"
#include "wizchip_spi.h"

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 3, 0)
#include "esp_rom_sys.h"
#endif


#include <errno.h>



#define LWIP_SO_SNDRCVTIMEO_OPTTYPE struct timeval

typedef uint8_t  u8_t;
typedef int8_t   s8_t;
typedef uint16_t u16_t;
typedef int16_t  s16_t;
typedef uint32_t u32_t;
typedef int32_t  s32_t;


typedef u8_t sa_family_t;

typedef u32_t socklen_t;
struct sockaddr {
  u8_t        sa_len;
  sa_family_t sa_family;
  char        sa_data[14];
};

struct sockaddr_storage {
  u8_t        s2_len;
  sa_family_t ss_family;
  char        s2_data1[2];
  u32_t       s2_data2[3];
#if LWIP_IPV6
  u32_t       s2_data3[3];
#endif /* LWIP_IPV6 */
};
typedef u16_t in_port_t;
typedef u32_t in_addr_t;




struct in_addr {
  in_addr_t s_addr;
};

struct sockaddr_in {
  u8_t            sin_len;
  sa_family_t     sin_family;
  in_port_t       sin_port;
  struct in_addr  sin_addr;
#define SIN_ZERO_LEN 8
  char            sin_zero[SIN_ZERO_LEN];
};
#define LWIP_SO_SNDRCVTIMEO_OPTTYPE struct timeval
struct timeval {
  long    tv_sec;         /* seconds */
  long    tv_usec;        /* and microseconds */
};


#ifdef CONFIG_FREERTOS_NUMBER_OF_CORES
/* new in idf v5.3 */
#define NUMBER_OF_CORES CONFIG_FREERTOS_NUMBER_OF_CORES
#else
#define NUMBER_OF_CORES portNUM_PROCESSORS
#endif

#define TAG "iperf"

typedef struct {
    iperf_cfg_t cfg;
    bool finish;
    uint32_t actual_len;
    uint32_t buffer_len;
    uint8_t *buffer;
    uint32_t sockfd;
} iperf_ctrl_t;

bool g_iperf_is_running = false;
DRAM_ATTR static iperf_ctrl_t s_iperf_ctrl;
iperf_hook_func_t iperf_hook_func = NULL;

inline static bool iperf_is_udp_client(void)
{
    return ((s_iperf_ctrl.cfg.flag & IPERF_FLAG_CLIENT) && (s_iperf_ctrl.cfg.flag & IPERF_FLAG_UDP));
}

inline static bool iperf_is_udp_server(void)
{
    return ((s_iperf_ctrl.cfg.flag & IPERF_FLAG_SERVER) && (s_iperf_ctrl.cfg.flag & IPERF_FLAG_UDP));
}

inline static bool iperf_is_tcp_client(void)
{
    return ((s_iperf_ctrl.cfg.flag & IPERF_FLAG_CLIENT) && (s_iperf_ctrl.cfg.flag & IPERF_FLAG_TCP));
}

inline static bool iperf_is_tcp_server(void)
{
    return ((s_iperf_ctrl.cfg.flag & IPERF_FLAG_SERVER) && (s_iperf_ctrl.cfg.flag & IPERF_FLAG_TCP));
}

inline static int iperf_get_socket_error_code(int sockfd)
{
    return errno;
}

static int iperf_show_socket_error_reason(const char *str, int sockfd)
{
    int err = errno;
    if (err != 0) {
        ESP_LOGW(TAG, "%s error, error code: %d, reason: %s", str, err, strerror(err));
    }

    return err;
}

static void iperf_report_task(void *arg)
{
    uint32_t interval = s_iperf_ctrl.cfg.interval;
    uint32_t time = s_iperf_ctrl.cfg.time;
    TickType_t delay_interval = (interval * 1000) / portTICK_PERIOD_MS;
    uint32_t cur = 0;
    double average = 0;
    double actual_bandwidth = 0;
    int k = 1;
    char format_ch = 'M';

    /* NOTE: Output is not totally same with linux iperf */
    printf("\nInterval       Bandwidth\n");
    while (!s_iperf_ctrl.finish) {
        vTaskDelay(delay_interval);
        switch (s_iperf_ctrl.cfg.format) {
        case KBITS_PER_SEC:
            actual_bandwidth = (s_iperf_ctrl.actual_len / 1024.0 * 8) / interval;
            format_ch = 'K';
            break;
        case MBITS_PER_SEC:
            /* pass through */
        default:
            actual_bandwidth = (s_iperf_ctrl.actual_len / 1024.0 / 1024.0 * 8) / interval;
            break;
        }
        printf("%2d.0-%2d.0 sec  %.2f %cbits/sec\n", cur, cur + interval, actual_bandwidth, format_ch);
        cur += interval;
        average = ((average * (k - 1) / k) + (actual_bandwidth / k));
        k++;
        s_iperf_ctrl.actual_len = 0;
        if (cur >= time) {
            printf("%2d.0-%2d.0 sec  %.2f %cbits/sec\n", 0, time, average, format_ch);
            break;
        }
    }

    s_iperf_ctrl.finish = true;
    vTaskDelete(NULL);
}

static esp_err_t iperf_start_report(void)
{
    int ret;

    ret = xTaskCreatePinnedToCore(iperf_report_task, IPERF_REPORT_TASK_NAME, IPERF_REPORT_TASK_STACK, NULL, IPERF_REPORT_TASK_PRIORITY, NULL, NUMBER_OF_CORES - 1);

    if (ret != pdPASS) {
        ESP_LOGE(TAG, "create task %s failed", IPERF_REPORT_TASK_NAME);
        return ESP_FAIL;
    }

    return ESP_OK;
}

IRAM_ATTR static void socket_recv(int recv_socket, struct sockaddr_storage listen_addr, uint8_t type)
{
    bool iperf_recv_start = true;
    uint8_t *buffer;
    int want_recv = 0;
    int actual_recv = 0;

#if IPERF_IPV6_ENABLED && IPERF_IPV4_ENABLED
    socklen_t socklen = (s_iperf_ctrl.cfg.type == IPERF_IP_TYPE_IPV6) ? sizeof(struct sockaddr_in6) : sizeof(struct sockaddr_in);
#elif IPERF_IPV6_ENABLED
    socklen_t socklen = sizeof(struct sockaddr_in6);
#else
    socklen_t socklen = sizeof(struct sockaddr_in);
#endif
    const char *error_log = (type == IPERF_TRANS_TYPE_TCP) ? "tcp server recv" : "udp server recv";

    buffer = s_iperf_ctrl.buffer;
    want_recv = s_iperf_ctrl.buffer_len;
    int pack_len = 0;
    /* busy loop*/
    while (!s_iperf_ctrl.finish) {
    
        getsockopt(recv_socket, SO_RECVBUF, &pack_len);
        if (pack_len > 0) {
            actual_recv = recv(recv_socket, buffer, want_recv);
            
            if (actual_recv < 0) {
                iperf_show_socket_error_reason(error_log, recv_socket);
                s_iperf_ctrl.finish = true;
                break;
            } else {
                if (iperf_recv_start) {
                    iperf_start_report();
                    iperf_recv_start = false;
                }
                s_iperf_ctrl.actual_len += actual_recv;
            }
        }
    }
}

IRAM_ATTR static void socket_send(int send_socket, struct sockaddr_storage dest_addr, uint8_t type, int bw_lim)
{
//     uint8_t *buffer;
//     uint32_t *pkt_id_p;
//     uint32_t pkt_cnt = 0;
//     int actual_send = 0;
//     int want_send = 0;
//     int period_us = -1;
//     int delay_us = 0;
//     int64_t prev_time = 0;
//     int64_t send_time = 0;
//     int err = 0;
//     struct timeval ts_now;

