seok930927/ESP32-iperf-W5500/managed_components/espressif__iperf/iperf.c
// #if IPERF_IPV6_ENABLED && IPERF_IPV4_ENABLED
//     const socklen_t socklen = (s_iperf_ctrl.cfg.type == IPERF_IP_TYPE_IPV6) ? sizeof(struct sockaddr_in6) : sizeof(struct sockaddr_in);
// #elif IPERF_IPV6_ENABLED
//     const socklen_t socklen = sizeof(struct sockaddr_in6);
// #else
//     const socklen_t socklen = sizeof(struct sockaddr_in);
// #endif
//     const char *error_log = (type == IPERF_TRANS_TYPE_TCP) ? "tcp client send" : "udp client send";

//     buffer = s_iperf_ctrl.buffer;
//     pkt_id_p = (uint32_t *)s_iperf_ctrl.buffer;
//     want_send = s_iperf_ctrl.buffer_len;
//     iperf_start_report();

//     if (bw_lim > 0) {
//         period_us = want_send * 8 / bw_lim;
//     }

//     while (!s_iperf_ctrl.finish) {
//         if (period_us > 0) {
//             gettimeofday(&ts_now, NULL);
//             send_time = ts_now.tv_sec * 1000000L + ts_now.tv_usec;
//             if (actual_send > 0) {
//                 // Last packet "send" was successful, check how much off the previous loop duration was to the ideal send period. Result will adjust the
//                 // next send delay.
//                 delay_us += period_us + (int32_t)(prev_time - send_time);
//             } else {
//                 // Last packet "send" was not successful. Ideally we should try to catch up the whole previous loop duration (e.g. prev_time - send_time).
//                 // However, that's not possible since the most probable reason why the send was unsuccessful is the HW was not able to process the packet.
//                 // Hence, we cannot queue more packets with shorter (or no) delay to catch up since we are already at the performance edge. The best we
//                 // can do is to reset the send delay (which is probably big negative number) and start all over again.
//                 delay_us = 0;
//             }
//             prev_time = send_time;
//         }
//         *pkt_id_p = htonl(pkt_cnt++); // datagrams need to be sequentially numbered
//         actual_send = sendto(send_socket, buffer, want_send, 0, (struct sockaddr *)&dest_addr, socklen);
//         if (actual_send != want_send) {
//             if (type == IPERF_TRANS_TYPE_UDP) {
//                 err = iperf_get_socket_error_code(send_socket);
//                 // ENOMEM & ENOBUFS is expected under heavy load => do not print it
//                 if ((err != ENOMEM) && (err != ENOBUFS)) {
//                     iperf_show_socket_error_reason(error_log, send_socket);
//                 }
//             } else if (type == IPERF_TRANS_TYPE_TCP) {
//                 iperf_show_socket_error_reason(error_log, send_socket);
//                 break;
//             }
//         } else {
//             s_iperf_ctrl.actual_len += actual_send;
//         }
//         // The send delay may be negative, it indicates we are trying to catch up and hence to not delay the loop at all.
//         if (delay_us > 0) {
// #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 3, 0)
//             esp_rom_delay_us(delay_us);
// #else
//             ets_delay_us(delay_us);
// #endif
//         }
//     }
}

static int tcp_listen_socket = -1;
static esp_err_t iperf_run_tcp_server(void)
{
    printf("TCP server started (not implemented)\n");


    int server_socket = 0;
    int opt = 1;
    int err = 0;
    esp_err_t ret = ESP_OK;
    struct timeval timeout = { 0 };
    socklen_t addr_len = sizeof(struct sockaddr);
    struct sockaddr_storage listen_addr = { 0 };
    struct sockaddr_in listen_addr4 = { 0 };
    struct sockaddr_in remote_addr = { 0 };
/*
    if (s_iperf_ctrl.cfg.type == IPERF_IP_TYPE_IPV6) {
        ESP_GOTO_ON_FALSE(false, ESP_ERR_INVALID_ARG, exit, TAG, "Invalid iperf address type!");
    } else if (s_iperf_ctrl.cfg.type == IPERF_IP_TYPE_IPV4) {
#if IPERF_IPV4_ENABLED
        listen_addr4.sin_family = AF_INET;
        listen_addr4.sin_port = htons(s_iperf_ctrl.cfg.sport);
        listen_addr4.sin_addr.s_addr = s_iperf_ctrl.cfg.source_ip4;

        tcp_listen_socket = socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
        ESP_GOTO_ON_FALSE((tcp_listen_socket >= 0), ESP_FAIL, exit, TAG, "Unable to create socket: errno %d", errno);

        setsockopt(tcp_listen_socket, SOL_SOCKET, SO_REUSEADDR, &opt, sizeof(opt));

        ESP_LOGI(TAG, "Socket created");

        err = bind(tcp_listen_socket, (struct sockaddr *)&listen_addr4, sizeof(listen_addr4));
        ESP_GOTO_ON_FALSE((err == 0), ESP_FAIL, exit, TAG, "Socket unable to bind: errno %d, IPPROTO: %d", errno, AF_INET);

        err = listen(tcp_listen_socket, 5);
        ESP_GOTO_ON_FALSE((err == 0), ESP_FAIL, exit, TAG, "Error occurred during listen: errno %d", errno);
        memcpy(&listen_addr, &listen_addr4, sizeof(listen_addr4));
#else
        ESP_GOTO_ON_FALSE(false, ESP_ERR_INVALID_ARG, exit, TAG, "Invalid iperf address type!");
#endif
    }
    timeout.tv_sec = IPERF_SOCKET_RX_TIMEOUT;
    setsockopt(tcp_listen_socket, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout));

    if (s_iperf_ctrl.cfg.type == IPERF_IP_TYPE_IPV6) {
#if IPERF_IPV6_ENABLED
        client_socket = accept(tcp_listen_socket, (struct sockaddr *)&remote_addr6, &addr_len);
        ESP_GOTO_ON_FALSE((client_socket >= 0), ESP_FAIL, exit, TAG, "Unable to accept connection: errno %d", errno);
        ESP_LOGI(TAG, "accept: %s,%d", inet6_ntoa(remote_addr6.sin6_addr), htons(remote_addr6.sin6_port));
#endif
    } else if (s_iperf_ctrl.cfg.type == IPERF_IP_TYPE_IPV4) {
#if IPERF_IPV4_ENABLED
        client_socket = accept(tcp_listen_socket, (struct sockaddr *)&remote_addr, &addr_len);
        ESP_GOTO_ON_FALSE((client_socket >= 0), ESP_FAIL, exit, TAG, "Unable to accept connection: errno %d", errno);
        ESP_LOGI(TAG, "accept: %s,%d", inet_ntoa(remote_addr.sin_addr), htons(remote_addr.sin_port));
#endif
    }

    timeout.tv_sec = IPERF_SOCKET_RX_TIMEOUT;
    setsockopt(client_socket, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout));
// s_iperf_ctrl.cfg.dport = ntohs(remote_addr.sin_port);

*/
    if (iperf_hook_func) {
        iperf_hook_func(IPERF_TCP_SERVER, IPERF_STARTED);
    }
    printf(" socket init wait.... %d \n", s_iperf_ctrl.cfg.sport);
    uint8_t ip[4];
    getSIPR(ip); 

    printf(" sip = %d.%d.%d.%d \n", ip[0], ip[1], ip[2], ip[3] );
    /* socket init */
    uint8_t socket_established = 0;
    while (!socket_established) {
        switch (getSn_SR(server_socket)) {
            case SOCK_ESTABLISHED :
                socket_established = 1; 
                break;
            case SOCK_CLOSE_WAIT :
                disconnect(server_socket);
                break;
            case SOCK_INIT :
                listen(server_socket);
                break;
            case SOCK_CLOSED:
                socket(server_socket, Sn_MR_TCP, s_iperf_ctrl.cfg.sport, 0x20);

                break;
            default:
                break;
        }
    }
    printf("by lihan TCP Socket server established.\n");
    

     socket_recv(server_socket, listen_addr, IPERF_TRANS_TYPE_TCP);

    if (server_socket != -1) {
        close(server_socket);
        ESP_LOGI(TAG, "TCP Socket server is closed.");
    }

    if (tcp_listen_socket != -1) {
        // shutdown(tcp_listen_socket, 0);
        close(tcp_listen_socket);
        ESP_LOGD(TAG, "TCP listen socket is closed.");
    }


    if (iperf_hook_func) {
        iperf_hook_func(IPERF_TCP_SERVER, IPERF_STOPPED);
    }
    s_iperf_ctrl.finish = true;

