seok930927/ESP32-iperf-W5500/managed_components/espressif__iperf/iperf.c
    return 0;

}

static esp_err_t iperf_run_tcp_client(void)
{
//     int client_socket = -1;
//     int err = 0;
//     esp_err_t ret = ESP_OK;
//     struct timeval timeout = { 0 };
//     struct sockaddr_storage dest_addr = { 0 };
// #if IPERF_IPV4_ENABLED
//     struct sockaddr_in dest_addr4 = { 0 };
// #endif
// #if IPERF_IPV6_ENABLED
//     struct sockaddr_in6 dest_addr6 = { 0 };
// #endif
//     if (s_iperf_ctrl.cfg.type == IPERF_IP_TYPE_IPV6) {
// #if IPERF_IPV6_ENABLED
//         client_socket = socket(AF_INET6, SOCK_STREAM, IPPROTO_IPV6);
//         ESP_GOTO_ON_FALSE((client_socket >= 0), ESP_FAIL, exit, TAG, "Unable to create socket: errno %d", errno);

//         inet6_aton(s_iperf_ctrl.cfg.destination_ip6, &dest_addr6.sin6_addr);
//         dest_addr6.sin6_family = AF_INET6;
//         dest_addr6.sin6_port = htons(s_iperf_ctrl.cfg.dport);

//         err = connect(client_socket, (struct sockaddr *)&dest_addr6, sizeof(struct sockaddr_in6));
//         ESP_GOTO_ON_FALSE((err == 0), ESP_FAIL, exit, TAG, "Socket unable to connect: errno %d", errno);
//         ESP_LOGI(TAG, "Successfully connected");
//         memcpy(&dest_addr, &dest_addr6, sizeof(dest_addr6));
// #else
//         ESP_GOTO_ON_FALSE(false, ESP_ERR_INVALID_ARG, exit, TAG, "Invalid iperf address type!");
// #endif
//     } else if (s_iperf_ctrl.cfg.type == IPERF_IP_TYPE_IPV4) {
// #if IPERF_IPV4_ENABLED
//         client_socket = socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
//         ESP_GOTO_ON_FALSE((client_socket >= 0), ESP_FAIL, exit, TAG, "Unable to create socket: errno %d", errno);

//         dest_addr4.sin_family = AF_INET;
//         dest_addr4.sin_port = htons(s_iperf_ctrl.cfg.dport);
//         dest_addr4.sin_addr.s_addr = s_iperf_ctrl.cfg.destination_ip4;
//         err = connect(client_socket, (struct sockaddr *)&dest_addr4, sizeof(struct sockaddr_in));
//         ESP_GOTO_ON_FALSE((err == 0), ESP_FAIL, exit, TAG, "Socket unable to connect: errno %d", errno);
//         ESP_LOGI(TAG, "Successfully connected");
//         memcpy(&dest_addr, &dest_addr4, sizeof(dest_addr4));
// #else
//         ESP_GOTO_ON_FALSE(false, ESP_ERR_INVALID_ARG, exit, TAG, "Invalid iperf address type!");
// #endif
//     }
//     timeout.tv_sec = IPERF_SOCKET_TCP_TX_TIMEOUT;
//     setsockopt(client_socket, SOL_SOCKET, SO_SNDTIMEO, &timeout, sizeof(timeout));

//     if (iperf_hook_func) {
//         iperf_hook_func(IPERF_TCP_CLIENT, IPERF_STARTED);
//     }
//     socket_send(client_socket, dest_addr, IPERF_TRANS_TYPE_TCP, s_iperf_ctrl.cfg.bw_lim);

// exit:
//     if (client_socket != -1) {
//         shutdown(client_socket, 0);
//         close(client_socket);
//         ESP_LOGI(TAG, "TCP Socket client is closed.");
//     }
//     if (iperf_hook_func) {
//         iperf_hook_func(IPERF_TCP_CLIENT, IPERF_STOPPED);
//     }
//     s_iperf_ctrl.finish = true;
//     return ret;
    return 0;
}

static esp_err_t iperf_run_udp_server(void)
{
//     int listen_socket = -1;
//     int opt = 1;
//     int err = 0;
//     esp_err_t ret = ESP_OK;
//     struct timeval timeout = { 0 };
//     struct sockaddr_storage listen_addr = { 0 };
// #if IPERF_IPV4_ENABLED
//     struct sockaddr_in listen_addr4 = { 0 };
// #endif
// #if IPERF_IPV6_ENABLED
//     struct sockaddr_in6 listen_addr6 = { 0 };
// #endif

//     if (s_iperf_ctrl.cfg.type == IPERF_IP_TYPE_IPV6) {
// #if IPERF_IPV6_ENABLED
//         // The UDP server listen at the address "::", which means all addresses can be listened to.
//         inet6_aton("::", &listen_addr6.sin6_addr);
//         listen_addr6.sin6_family = AF_INET6;
//         listen_addr6.sin6_port = htons(s_iperf_ctrl.cfg.sport);

//         listen_socket = socket(AF_INET6, SOCK_DGRAM, IPPROTO_UDP);
//         ESP_GOTO_ON_FALSE((listen_socket >= 0), ESP_FAIL, exit, TAG, "Unable to create socket: errno %d", errno);
//         ESP_LOGI(TAG, "Socket created");

//         setsockopt(listen_socket, SOL_SOCKET, SO_REUSEADDR, &opt, sizeof(opt));

//         err = bind(listen_socket, (struct sockaddr *)&listen_addr6, sizeof(struct sockaddr_in6));
//         ESP_GOTO_ON_FALSE((err == 0), ESP_FAIL, exit, TAG, "Socket unable to bind: errno %d", errno);
//         ESP_LOGI(TAG, "Socket bound, port %" PRIu16, listen_addr6.sin6_port);

//         memcpy(&listen_addr, &listen_addr6, sizeof(listen_addr6));
// #else
//         ESP_GOTO_ON_FALSE(false, ESP_ERR_INVALID_ARG, exit, TAG, "Invalid iperf address type!");
// #endif
//     } else if (s_iperf_ctrl.cfg.type == IPERF_IP_TYPE_IPV4) {
// #if IPERF_IPV4_ENABLED
//         listen_addr4.sin_family = AF_INET;
//         listen_addr4.sin_port = htons(s_iperf_ctrl.cfg.sport);
//         listen_addr4.sin_addr.s_addr = s_iperf_ctrl.cfg.source_ip4;

//         listen_socket = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
//         ESP_GOTO_ON_FALSE((listen_socket >= 0), ESP_FAIL, exit, TAG, "Unable to create socket: errno %d", errno);
//         ESP_LOGI(TAG, "Socket created");

//         setsockopt(listen_socket, SOL_SOCKET, SO_REUSEADDR, &opt, sizeof(opt));

//         err = bind(listen_socket, (struct sockaddr *)&listen_addr4, sizeof(struct sockaddr_in));
//         ESP_GOTO_ON_FALSE((err == 0), ESP_FAIL, exit, TAG, "Socket unable to bind: errno %d", errno);
//         ESP_LOGI(TAG, "Socket bound, port %d", listen_addr4.sin_port);
//         memcpy(&listen_addr, &listen_addr4, sizeof(listen_addr4));
// #else
//         ESP_GOTO_ON_FALSE(false, ESP_ERR_INVALID_ARG, exit, TAG, "Invalid iperf address type!");
// #endif
//     }

//     timeout.tv_sec = IPERF_SOCKET_RX_TIMEOUT;
//     setsockopt(listen_socket, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout));

//     if (iperf_hook_func) {
//         iperf_hook_func(IPERF_UDP_SERVER, IPERF_STARTED);
//     }
//     socket_recv(listen_socket, listen_addr, IPERF_TRANS_TYPE_UDP);

// exit:
//     if (listen_socket != -1) {
//         shutdown(listen_socket, 0);
//         close(listen_socket);
//     }
//     ESP_LOGI(TAG, "Udp socket server is closed.");
//     if (iperf_hook_func) {
//         iperf_hook_func(IPERF_UDP_SERVER, IPERF_STOPPED);
//     }
//     s_iperf_ctrl.finish = true;
//     return ret;
    return 0;
}

