seok930927/ESP32-iperf-W5500/managed_components/espressif__iperf/iperf.c
static esp_err_t iperf_run_udp_client(void)
{
//     int client_socket = -1;
//     int opt = 1;
//     esp_err_t ret = ESP_OK;
//     struct sockaddr_storage dest_addr = { 0 };
// #if IPERF_IPV4_ENABLED
//     struct sockaddr_in dest_addr4 = { 0 };
// #endif
// #if IPERF_IPV6_ENABLED
//     struct sockaddr_in6 dest_addr6 = { 0 };
// #endif

//     if (s_iperf_ctrl.cfg.type == IPERF_IP_TYPE_IPV6) {
// #if IPERF_IPV6_ENABLED
//         inet6_aton(s_iperf_ctrl.cfg.destination_ip6, &dest_addr6.sin6_addr);
//         dest_addr6.sin6_family = AF_INET6;
//         dest_addr6.sin6_port = htons(s_iperf_ctrl.cfg.dport);

//         client_socket = socket(AF_INET6, SOCK_DGRAM, IPPROTO_IPV6);
//         ESP_GOTO_ON_FALSE((client_socket >= 0), ESP_FAIL, exit, TAG, "Unable to create socket: errno %d", errno);
//         ESP_LOGI(TAG, "Socket created, sending to %s:%d", s_iperf_ctrl.cfg.destination_ip6, s_iperf_ctrl.cfg.dport);

//         setsockopt(client_socket, SOL_SOCKET, SO_REUSEADDR, &opt, sizeof(opt));
//         memcpy(&dest_addr, &dest_addr6, sizeof(dest_addr6));
// #else
//         ESP_GOTO_ON_FALSE(false, ESP_ERR_INVALID_ARG, exit, TAG, "Invalid iperf address type!");
// #endif
//     } else if (s_iperf_ctrl.cfg.type == IPERF_IP_TYPE_IPV4) {
// #if IPERF_IPV4_ENABLED
//         dest_addr4.sin_family = AF_INET;
//         dest_addr4.sin_port = htons(s_iperf_ctrl.cfg.dport);
//         dest_addr4.sin_addr.s_addr = s_iperf_ctrl.cfg.destination_ip4;

//         client_socket = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
//         ESP_GOTO_ON_FALSE((client_socket >= 0), ESP_FAIL, exit, TAG, "Unable to create socket: errno %d", errno);
//         ESP_LOGI(TAG, "Socket created, sending to %d:%d", s_iperf_ctrl.cfg.destination_ip4, s_iperf_ctrl.cfg.dport);

//         setsockopt(client_socket, SOL_SOCKET, SO_REUSEADDR, &opt, sizeof(opt));
//         memcpy(&dest_addr, &dest_addr4, sizeof(dest_addr4));
// #else
//         ESP_GOTO_ON_FALSE(false, ESP_ERR_INVALID_ARG, exit, TAG, "Invalid iperf address type!");
// #endif
//     }

//     if (iperf_hook_func) {
//         iperf_hook_func(IPERF_UDP_CLIENT, IPERF_STARTED);
//     }
//     socket_send(client_socket, dest_addr, IPERF_TRANS_TYPE_UDP, s_iperf_ctrl.cfg.bw_lim);

// exit:
//     if (client_socket != -1) {
//         shutdown(client_socket, 0);
//         close(client_socket);
//     }
//     ESP_LOGI(TAG, "UDP Socket client is closed");
//     if (iperf_hook_func) {
//         iperf_hook_func(IPERF_UDP_CLIENT, IPERF_STOPPED);
//     }
//     s_iperf_ctrl.finish = true;
//     return ret;
    return 0;
}

static void iperf_task_traffic(void *arg)
{
    if (iperf_is_udp_client()) {
        iperf_run_udp_client();
    } else if (iperf_is_udp_server()) {
        iperf_run_udp_server();
    } else if (iperf_is_tcp_client()) {
        iperf_run_tcp_client();
    } else {
        iperf_run_tcp_server();
    }

    if (s_iperf_ctrl.buffer) {
        free(s_iperf_ctrl.buffer);
        s_iperf_ctrl.buffer = NULL;
    }
    ESP_LOGI(TAG, "iperf exit");
    g_iperf_is_running = false;
    vTaskDelete(NULL);
}

static uint32_t iperf_get_buffer_len(void)
{
    if (iperf_is_udp_client()) {
#if IPERF_IPV6_ENABLED
        if (s_iperf_ctrl.cfg.len_send_buf) {
            return s_iperf_ctrl.cfg.len_send_buf;
        } else if (s_iperf_ctrl.cfg.type == IPERF_IP_TYPE_IPV6) {
            return IPERF_DEFAULT_IPV6_UDP_TX_LEN;
        } else {
            return IPERF_DEFAULT_IPV4_UDP_TX_LEN;
        }
#else
        return (s_iperf_ctrl.cfg.len_send_buf == 0 ? IPERF_DEFAULT_IPV4_UDP_TX_LEN : s_iperf_ctrl.cfg.len_send_buf);
#endif
    } else if (iperf_is_udp_server()) {
        return IPERF_DEFAULT_UDP_RX_LEN;
    } else if (iperf_is_tcp_client()) {
        return (s_iperf_ctrl.cfg.len_send_buf == 0 ? IPERF_DEFAULT_TCP_TX_LEN : s_iperf_ctrl.cfg.len_send_buf);
    } else {
        return IPERF_DEFAULT_TCP_RX_LEN;
    }
    return 0;

}

esp_err_t iperf_start(iperf_cfg_t *cfg)
{
    BaseType_t ret;

    if (!cfg) {
        return ESP_FAIL;
    }

    if (g_iperf_is_running) {
        ESP_LOGW(TAG, "iperf is running");
        return ESP_FAIL;
    }

    memset(&s_iperf_ctrl, 0, sizeof(s_iperf_ctrl));
    memcpy(&s_iperf_ctrl.cfg, cfg, sizeof(*cfg));
    g_iperf_is_running = true;
    s_iperf_ctrl.finish = false;
    s_iperf_ctrl.buffer_len = iperf_get_buffer_len();
    s_iperf_ctrl.buffer = (uint8_t *)malloc(s_iperf_ctrl.buffer_len);
    if (!s_iperf_ctrl.buffer) {
        ESP_LOGE(TAG, "create buffer: not enough memory");
        return ESP_FAIL;
    }
    memset(s_iperf_ctrl.buffer, 0, s_iperf_ctrl.buffer_len);
    ret = xTaskCreatePinnedToCore(iperf_task_traffic, IPERF_TRAFFIC_TASK_NAME, IPERF_TRAFFIC_TASK_STACK, NULL, IPERF_TRAFFIC_TASK_PRIORITY, NULL, NUMBER_OF_CORES - 1);
    if (ret != pdPASS) {
        ESP_LOGE(TAG, "create task %s failed", IPERF_TRAFFIC_TASK_NAME);
        free(s_iperf_ctrl.buffer);
        s_iperf_ctrl.buffer = NULL;
        return ESP_FAIL;
    }
    return ESP_OK;
}

esp_err_t iperf_stop(void)
{
    /* close listen socket to stop tcp server */
    if (tcp_listen_socket != -1) {
        // shutdown(tcp_listen_socket, 0);
        close(tcp_listen_socket);
        ESP_LOGD(TAG, "TCP listen socket is closed.");
    }
    if (g_iperf_is_running) {
        s_iperf_ctrl.finish = true;
    }

    for (int i = 0; i < 10; i ++) {
        if (!g_iperf_is_running) {
            break;
        }
        ESP_LOGI(TAG, "wait current iperf to stop ...");
        vTaskDelay(400 / portTICK_PERIOD_MS);
    }

    if (g_iperf_is_running) {
        ESP_LOGE(TAG, "DONE.IPERF_STOP,FAIL.");
    } else {
        ESP_LOGI(TAG, "DONE.IPERF_STOP,OK.");
    }
    return ESP_OK;
}

void iperf_register_hook_func(iperf_hook_func_t func)
{
    iperf_hook_func = func;
}
